{"id": 9, "data": {"text": "The respondent No\tFacts\nI was tried before the Court of Sessions, Visakhapatnam for offences under s. 120-B, Indian Penal Code, s. 409, s. 477-A\tFacts\nand s. 471 read with s. 467, I.P.C\tFacts\nwhile respondent No. 2 was tried for an offence under s. 120-B and for offences under ss\tFacts\n409 read with s. 109, 477-A and 471 read with s. 467, I.P.C\tFacts\nEach of the respondents was convicted of the first two offences, but\tFacts\nthe respondent No\tFacts\nI alone was convicted of the other two offences\tFacts\nVarious sentences were passed against them by the Additional Sessions judge, Visakhapatnam, who presided over the court\tFacts\nThe respondents preferred appeals before the High Court challenging their convictions and sentences\tFacts\nThe State on the other hand preferred an application for revision under s. 439, Cr\tFacts\nP.C. for the enhancement of the sentences passed on the respondents\tFacts\nThe High Court allowed the two appeals, acquitted the respondents and dismissed the application for revision preferred by the State\tFacts\nThe State of Andhra Pradesh has come up before this Court in appeal by obtaining special leave under Art\tFacts\n136 of the Constitution\tFacts\nThe prosecution case in so far as it is material for the decision of this appeal is as follows\tFacts\nIn the year 1929 the Andhra Engineering Co., which was originally a partnership firm formed by one D.L.N. Raju was converted into a private limited, company with its headquarters at Visakhapatnam\tFacts\nWe shall refer to this company throughout as the AECO\tFacts\nIt obtained licences from the Government under the Electricity Act for supply of electrical energy to Visakhapatnam, Anakapalli and some other places\tFacts\nAs the AECO did not have the necessary capital to undertake the work Raju floated in the year 1933 a public limited company called Visakhapatnam Electric Supply Corporation Ltd.,  and another in the year 1936 called the Anakapalli Electric Supply Corporation Ltd\tFacts\nThe AECO transferred its licences for the supply of electrical energy to the consumers of Visakhapatnam to VESCO and similarly transferred to AECO the licence to supply electrical energy to consumers at Anakapalli\tFacts\nThe AECO was appointed Managing Agent for each of these corporations under separate agreements\tFacts\nSome time later other industrial concerns, the Andhra Cements Ltd., Vi jayawada and the East Coast Ceremics\tFacts\nRajahmurthy were started apparently by Raju himself- and the AECO was appointed the Managing Agent of each of these concerns\tFacts\nThe original managing agency agreement in favour of AECO with respect to VESCO was for a period of 15 years i.e., from 1933 to 1948 and was later renewed for the remaining term of the currency of the licence granted by the Government under the Electricity Act\tFacts\nA mention may be made of the fact that in June, 1952 the VESCO undertaking was acquired by the Government under the provisions of the \"'Electricity Undertaking Acquisition Act\" but nothing turns on it\tFacts\nThe VESCO had its own Board of Directors while the AECO had also its own separate Board of Directors\tFacts\nThe VESCO had no Managing Director but at each meeting of its Board of Directors one of the Directors used to be elected Chairman\tFacts\nThe same practice was followed at the meeting of the general body of the shareholders\tFacts\nThe AECO on the other band always had a Managing Director, first of whom was D.L.N. Raju\tFacts\nHe died in the year 1939 and was succeeded by R.K.N.G. Raju, an Advocate of Rajahmundry\tFacts\nThis person, however, did not shift to Visakhapatnam on his becoming the Managing Director but continued to stay most of the time at Rajahmundry\tFacts\nAccording to the prosecution both these concerns were running smoothly and efficiently during the lifetime of D.L.N. Raju because he was personally attending to their affairs\tArgument\nHis successor, however, apart from the fact that be continued to be staying mostly at Rajahmundry, was also interested in several other ventures, including a sugar factory at Dewas in Central India\tArgument\nEventually many of those ventures failed\tArgument\nAccording to the prosecution the second Raju was not bestowing sufficient care and attention on the affairs of VESCO\tArgument\nThe AECO as Managing Agents of VESCO had appointed in the year 1939 one D.V. Appala Raju, a trusted employee, as its representative and as the secretary of VESCO\tFacts\nIn 1944 this person resigned from his appointments and started his own business in radio and electrical goods in the name of D. Brothers\tFacts\nHe was succeeded by T. Visweswara Rao, P.W. 6, an employee of the AECO\tFacts\nThe respondent No. 1\tRatio of the decision\nGaneswara Rao was also an old employee of AECO, having been appointed a stenotypist in the year 1923 on an initial salary of Rs\tRatio of the decision\np.m\tRatio of the decision\nEventually he became the Head Clerk therein\tRatio of the decision\nHe pressed his claim for appointment as Secretary of VESCO and representative of the Managing Agents at Visakhapatnam and R .H.G\tRatio of the decision\nRaju appointed him to that post\tRatio of the decision\nAll this is not disputed\tRatio of the decision\nThe respondent No. 1, even after his appointment on two posts connected with VESCO, continued to work with the AECO also whose business had by then been confined only to that of Managing Agents of the four companies floated by D.L.N. Raju\tRatio of the decision\nIt is the prosecution case that as Secretary of VESCO and the resident representative of the Managing Agents, the respondent No\tArgument\nI was attending to the day to day affairs of VESCO, which included the receiving of all sums of money due to VESCO, spending money for the purpose of VESCO attending to the appointment, supervision and control of the staff of VESCO, purchasing materials required for the purpose of VESCO and supervising over the accounts of VESCO\tArgument\nHe was thus all important with respect to the every day affairs of VESCO\tArgument\nHis dual capacity enabled the respondent No\tArgument\nI to earn the confidence not only of the Directors of AECO but also of those of VESCO\tArgument\nThe accounts maintained by the VESCO used to be explained by him not only to the Directors but also to the shareholders\tArgument\nThe knowledge of the Financial position of VESCO obtained by them used to be derived essentially from the respondent No. 1\tArgument\nAs Secretary of VESCO it was his duty to convene the meetings of the Board of Directors, to present before them the periodical statement of receipts and expenditure of VESCO, to convene meetings of the General Body, to prepare the Managing Agents' report and the Director's report as also to see to the presentation of auditors' report and the statement of accounts\tArgument\nThe explanations of the Managing Agents and the Directors of VESCO with respect to the items mentioned in the orders of the Board used also to be placed by him before the shareholders\tArgument\nIt was also his duty to have the accounts of VESCO audited by the auditors elected by the general body and to produce before the auditors the relevant accounts, vouchers, bank statements and so on\tArgument\nThere were no complaints about the management of the affairs of VESCO or the AECO till the end of 1946 or the beginning of 1947\tArgument\nOne significant fact, however, which occurred prior to 1946 - is referred to by the prosecution\tArgument\nTill the -year 1945 Messrs C. P. Rao & Co., a firm of Chartered Accountants were the auditors of VESCO but after the respondent No\tArgument\nI became Secretary\tArgument\none B. Rajan was elected Auditor not only for VESCO but for all the other four concerns, including AECO\tArgument\nThis person was Auditor for Greenlands Hotel at Visakhapatnam\tArgument\nof which the respondent No\tArgument\nI was a Director\tArgument\nR.K.N.G. Raju took till towards the end of 1947 and died at Madras in April, 1948\tArgument\nAccording to the prosecution the respondent No. I wanted to take advantage of this fact and conceived of a scheme for misappropriating as much money belonging to VESCO as possible before the managing agency agreement of AECO came to an end in October, 1948\tArgument\nI secured the promotion of the approver K.V. Ramana, who was originally Accounts Clerk to the post of Senior Accountant\tArgument\nSimilarly K. V. Gopala Raju was transferred from the post of Stores Clerk to the general department and K.S.N. Murty, the discharged accused, was appointed Stores Clerk in his place\tArgument\nLater, however, Murty was also got transferred to the general section and replaced by P. W. 18\tArgument\nSrinivasa Rao originally a stores boy\tArgument\nThe approver who was originally an Accounts clerk with the AECO was, it may be mentioned, appointed a cashier in VESCO in 1946 at the instance of the respondent No\tArgument\nI and was thus beholden to him\tArgument\nHe was later promoted as Senior Accountant and in his place the respondent No. 2\tArgument\nLaksbminarayana Rao was appointed the Cashier\tArgument\nAccording to the prosecution the respondent No\tArgument\nI took both the approver and Lakshminarayana Rao in his confidence as also some other persons \"known and unknown\" for carrying out his nefarious purpose, namely, the misappropriation of the funds of VESCO during the subsistence of AECO's managing agency of VESCO\tArgument\nThe conspiracy is said to have been hatched in the year 1947 and falsification of accounts and misappropriation of funds of VESCO went on till the end of the accounting year\tArgument\nThe term of the managing agency was renewed in 1943 and AECO con- tinued to be managing agents until the VESCO was taken over by the Government in 1952\tArgument\nI continued to be the Secretary of VESCO and resident representative of the Managing Agents throughout the period of conspiracy\tArgument\nAfter the death of R.K.N.G. Raju, it was discovered that the AECO was indebted to many concerns which were under its managing agency, the liability being shown either as that of AECO or that of R.K.N.G. Raju personally\tArgument\nAgain, the VESCO was shown as indebted to the Andhra Cement, ; to the extent of Rs\tArgument\n42, 000\tArgument\nThis amount was, however, paid by the AECO from the funds of VESCO\tArgument\nI and some of his friends were in search of a rich and substantial man who would be amenable to them to fill the post of Managing Director of AECO\tArgument\nEventually their choice fell on G. V. Subba Raju, P. W. 25, a resident of Manchili, who held a large number of shares in the AECO and who was, besides, related to R.K.N.G. Raju by marriage\tFacts\nIt is said that this person has not received much education and knows only bow to sign his name in English\tFacts\nHe was assured that by consenting to become the Managing Director be would not be required to discharge onerous duties and that the respondent No\tFacts\nI would look to all the affairs of VESCO\tFacts\nHe was also told that apart from signing important papers which may be sent to him by the respondent No. I from time to time to Manchili or wherever be might be would have no work to do\tFacts\nHe agreed and was elected Managing Director of AECO in the middle of 1948\tFacts\nUpon this understanding he accepted the position offered to him\tFacts\nThe VESCO used to receive large amounts of money from high tension power consumers such as the railways, K. G. Hospital, the Port Administration, the Andhra University etc\tFacts\nby cheques\tFacts\nBut domestic consumers usually paid their bills in cash to the bill collectors who used to hand over their collections to the respondent No. 2\tFacts\nThe respondent No. 2 was asked by the respondent No\tFacts\nI to maintain a private note book\tFacts\nIn \"that book payments which used to be made by respondent No. 2 on the basis of slips issued by the respondent No\tFacts\nI  used to be noted and the amount totalled up at the end of the day\tFacts\nThis amount was posted in VESCO's Cash Handover Book as \"'by safe\" indicating that this amount was kept in the safe, though in fact it was not\tFacts\nOn the basis of the entries in the Handover Book the final accounts were written up\tFacts\nI opened four personal accounts in different banks, including the Imperial Bank of India\tFacts\nWhen the respondent No\tFacts\nI had to issue a personal cheque on any of these Banks he used to ask the second respondent to send an equivalent amount to the Bank concerned for being credited to his account\tFacts\nThese amounts also used to be noted in the private note book and entered\tFacts\nAnother thing which the respondent No\tFacts\nI initiated was opening a heading in the ledger called \"advance purchase of materials\tFacts\nAmounts which had been misappropriated used to be posted therein though in fact no orders were placed for any material\tFacts\nIt may be mentioned that Subba Raju used to visit Visakhapatnam twice a month and check up the account books\tFacts\nAt that time it used to be represented to him that the amounts which were shown to be in the safe and not found therein  had been sent to the Bank for being deposited\tFacts\nApparently Subba Raju was fully satisfied with this and other explanations and, therefore, he appointed one C. S. Raju, who was the Manager of Andhra Cements to supervise over the affairs of VESCO.Apparently because of this a new method of misappropriation was adopted by the respondents by starting in the VESCO account books, an account called \"suspense account\tFacts\nA lakh of rupees passed through that account\tFacts\nAmounts which were misappropriated used to find their way in this account\tFacts\nA new cash book was also said to have been prepared by the conspirators with the object of covering up the misappropriations which had been made\tFacts\nSubba Raju was not satisfied with the nature of supervision exercised by C. S. Raju over the affairs of VESCO because he used to look only at the cash book entries of the days on which he paid visits to VESCO's office, to which he used to go with previous intimation\tFacts\nBesides that, C. S. Raju's management of Andhra Cements had landed it into a loss of Rs\tFacts\n30, 000\tFacts\nBecause of all these things he had C. S. Raju replaced towards the end of the year 1951 by one Subbaramayya, a retired Finance Officer from the Madras Electricity Board both as a Director of Andhra Cements and as a Supervisor over the accounts of VESCO\tFacts\nSubbaramayya took his work seriously and called for information on a number of points from the respondent No. 1\tFacts\nHe, however, was unable to obtain any information\tFacts\nIn January, 1952 he therefore brought one S. G. Krishna Aiyar who had vast experience in the maintenance of accounts of electrical undertaking's having been Chief Accountant of the South Madras Electric Supply Corporation, to undertake an investigation and then to act as Financial Adviser\tFacts\nIn the meantime on November 29, 1951 there was a meeting of the General Body at which the accounts were, among other things, to be considered\tFacts\nThere was a considerable uproar at that meeting because the respondent No. 1 said that the Auditor's report had not been received\tFacts\nThe shareholders felt that the report had been received but was being suppressed or deliberately withheld\tFacts\nHowever, the meeting was postponed and eventually held on December 9, 1951\tFacts\nOn that date the respondent No. 1 produced the auditor's report\tFacts\nAccording to the prosecution the report is a forged document\tArgument\nThat was also the feeling-of a number of shareholders who wanted to see the original but one Dutt who was Chairman of the meeting after seeing Ex\tFacts\nP. 234 said that the report seemed to be a genuine one\tFacts\nS. G. Krishna Aiyar after his appointment in January, 1952, made close enquiry and submitted an interim report\tFacts\nThat report showed that during the period 1948-49 Rs. 33, 271-10-0 shown as paid to the Andhra Power System were in fact not paid\tFacts\nThe respondent No. 1 on being asked to explain said that he would give his explanation to the Managing Director\tFacts\nThe Interim Report showed that there was a shortage of about Rs\tFacts\n90, 000/- for this period\tFacts\nOn February 12, 1952 the respondent No\tFacts\nI wrote to the Managing Director admitting his responsibility and agreed to make good the amounts found short or such other amounts as would be found short up to the end of March, 1952\tFacts\nFurther scrutiny of the accounts was being carried out by Krishna Aiyar and in his subsequent report he pointed out that Rs. 2, 38, 000/- which were shown as having been paid to the Andhra Power System had actually not been paid\tFacts\nIn fact in April, 1952 the Collector attached VESCO properties for realising this amount\tFacts\nOn April 30, 1952 the respondent No. 1, by selling some of his property, himself paid Rs. 50, 000/- to the Andhra Power System towards the sum due to it from VESCO and had promised to pay the balance shortly thereafter\tFacts\nHe was given time for doing so but he failed to pay it\tFacts\nThe Directors of VESCO thereafter authorised K. S. Dutt, one of the Directors to lodge a complaint with the police which he accordingly lodged on May 19, 1952\tFacts\nOn the next day the police placed an armed guard around the office of the respondent No\tFacts\nI and seized a number of papers\tFacts\nAs a result of investigation they found that there was a total misappropriation of Rs\tFacts\n3, 40, 000\tFacts\nOn May 13, 1954 a chargesheet was filed against the two respondents as well as Murti and the approver Ramana\tFacts\nOD September 13, 1954 Ramana offered to make a full Confession to the Additional District Magistrate (Independent) who was empowered to grant pardon under s. 337 of i he Code of Criminal Procedure\tFacts\nHe, however, directed Ramana to make his confession before a SubMagistrate\tFacts\nThe latter accordingly made a confession on November 15, 1954 and on November 17, 1954 the Additional District Magistrate (Independent) granted him pardon and that is how he came to be examined as a witness in this case\tFacts\nAs already stated, the Additional Sessions judge convicted both the respondents, the respondent No\tFacts\nI in respect of each head of the offences with which he was charged and the respondent No. 2 in respect only of the offences of conspiracy and misappropriation\tFacts\nThe High Court set aside the conviction of the respondents on a number of grounds\tRuling by Lower Court\nIn the first place according to the High Court, joint trial of two or more persons in respect of different offences cornmitted by each of them is illegal and that here as they were charged with having committed offences under s. 120-B, s. 409, s. 477-A and s. 476/467, I.P.C\tRuling by Lower Court\nthey could not be tried jointly\tRuling by Lower Court\nAccording to it the provisions of s. 239 were of no avail\tRuling by Lower Court\nNext according to the High Court even if s. 239 is applicable its provisions are subject to those of s. 234 and as such the trial being for more than three offences was impermissible\tRuling by Lower Court\nThen according to the High Court offences under\tRuling by Lower Court\ns. 409 and s\tRuling by Lower Court\n471/467 are of different kinds and are not capable of joint commission\tRuling by Lower Court\nTherefore, they could not be jointly tried\tRuling by Lower Court\nFurther, according to the High Court where a conspiracy has yielded its fruits the conspirators can be charged with the actual offences committed and not with conspiracy to commit those offences\tRuling by Lower Court\nCharge of conspiracy, according to the High Court, can be validly made only when the prosecution establishes that every conspirator expected to receive a personal benefit from it and that the prosecution has not been able to establish that the respondent No. 2 or the approver evidently had any such expectations since they did not in fact receive any corresponding benefit\tRuling by Lower Court\nIn so far as the respondent No. 2 is concerned the High Court has held that since he was charged with a specific offence under s.409 I.P.C. he could not be convicted of mere abetment of an offence\tRuling by Lower Court\nThe approver's evidence was held by the High Court to be inadmissible because the pardon granted to him was illegal\tRuling by Lower Court\nThe High Court has also held that his evidence is unreliable and further that the Additional Sessions judge was in error in allowing him to refresh his memory by referring to various documents in a manner not permitted by s. 159 of the Evidence Act\tRuling by Lower Court\nThe High Court has further stated that inadmissible evidence was taken on record by the Additional Sessions judge, namely, account books of Billimoria Brothers, maintained in Gujrati and further that the Additional Sessions judge was in error in allowing the prosecution to use those account books for establishing absence of entries with regard to certain payments alleged in the VESCO books to have been made to them\tRuling by Lower Court\nFinally, the High Court held that the examination of the respondent under s. 342 of the Code was unfair for a number of reasons and that the Additional Sessions judge had failed to perform an important duty in that he did not call the attention of the respondents to the provisions of s. 342 which enable an accused person to give evidence in his own behalf\tRuling by Lower Court\nMr\tRuling by Lower Court\nBhimasankaram, appearing for the two respondents, however, has not sought to support the judgment of the High Court on all these points\tRuling by Lower Court\nThe points which he urged are briefly these: (1) That there was a misjoinder of charges and persons in that the various provisions of s. 239 were clubbed together and an omnibus charge of conspiracy was framed which on its face was one likely to embarrass the respondents and make their task of defending themselves difficult\tArgument\nThe procedure adopted in the investiga- tion and committal stages was irregular\tArgument\n3) Irrelevant evidence was introduced and some evidence was introduced in a manner not authorised by the Evidence Act\tArgument\n4) That the Court abused its powers under s.342, Cr\tArgument\nP.C. while conducting the examination of the respondents\tArgument\nThe evidence of the approver was inadmissible because the pardon granted to him was illegal, that, in any case, it is unreliable, was so found even by the Sessions judge and must, therefore, be rejected\tArgument\nIf the evidence of the approver is left out the remaining evidence would be inadequate to sustain the prosecution case\tArgument\nWe shall deal with Mr. Bhimasankaram's contentions in the order in which we have set them out\tRatio of the decision\nThe first question for consideration is whether there was a misjoinder of parties and of persons\tRatio of the decision\nThe first charge is in respect of the conspiracy alleged to have been entered into by the two respondents, K. V. Ramana, the approver, and others \"known and unknown\" to commit criminal breach of trust of the funds of VESCO and, in order to screen its detection, to falsify the accounts of VESCO and to use forged documents as genuine\tRatio of the decision\nOn the face of it this is a valid charge\tRatio of the decision\nBut certain objections have been taken to it with which we will deal at the appropriate place\tRatio of the decision\nThe second charge is for an offence of criminal breach of trust punishable under s. 409 and the accusation therein is that the two respondents along with Ramana, misappropriated 69 items aggregating to a little over Rs\tRatio of the decision\n3, 20, 000\tRatio of the decision\nIt is clear from the charge that some of the amounts were misappropriated between April, 1947 and March, 1950, some between April, 1947 and March, 1949, some between April, 1947 and March, 1951 and quite a large number between September, 1947 and March, 1950 and a still large number between April, 1951 and March, 1952\tRatio of the decision\nIt is thus apparent that offences committed within a space of 12 months were tried along with offences committed beyond that period\tRatio of the decision\nUnless, therefore, the provisions of s. 239 are applicable it would follow that there was a misjoinder of charges\tRatio of the decision\nThe third charge is that the two respondents, along with the approver\tRatio of the decision\nRamana made false entries on seven different dates in the account books between September 19, 1947 and March 18, 1952 and thus committed an offence under s. 477-A, I.P.C\tRatio of the decision\nThe fourth charge is that the two respondents, along with the approver\tRatio of the decision\nRamana forged six documents on different dates between March 28, 1949 and November 12, 1951 and thus committed an offence under s. 471 read with s. 467, I.P.C\tRatio of the decision\nAs we have pointed out earlier the respondent No\tRatio of the decision\nI alone was convicted by the Additional Sessions judge in respect of the third and fourth charges\tRatio of the decision\nMr. Bhimasankaram supports the reason given by the High Court for coming to the conclusion that there was a misjoinder of charges\tRatio of the decision\nThe main reasons upon which the conclusion of the High Court is based are firstly that there could be no clubbing together of the provisions of the various clauses of s. 239 and secondly that the respondents were charged with more than three offences of the same kind and that this was in contravention of s. 239 (c\tRatio of the decision\nIn coming to the conclusion that the provisions of various clauses of s. 239 cannot be applied cumulatively the High Court has relied upon the decision in Re: Vankavalapati Gopala Rao 1956 AIR(Andhra) 21\tPrecedent\nThere the learned judges have held thus: \"These clauses are mutually exclusive and they cannot be simultaneously applied and to construe them as supplementing each other would be enlarging the scope of the exceptions\tPrecedent\nEach clause is an exception to the general rule enacted in s. 233, Cr\tPrecedent\nP.C\tRatio of the decision\nIf such a combination is permissible, all persons accused of offences described in cls\tPrecedent\na) to (g) can be tried together in one case which certainly involves a bewildering multiplicity of charges and which would obviously set at naught the salutary principle contained in s. 233\tPrecedent\nThe chapter is split up into two sub-heads, '-Form of charges\"and\" Joinder of charges\tStatute\nSs\tStatute\n221 to 232 are comprised under the first sub-head and ss\tStatute\n233 to 240 in the second\tStatute\n221 to 223 deal with the framing and content of charge\tStatute\ns. 224 deals with the interpretation of the language of the charge and s. 225 with the effect of errors in the charge\tStatute\n226 to 231 deal with the power of the court with regard to framing and altering charges and the procedure to be adopted at the trial where a charge is found to be defective or there is no charge or where a new charge is to be framed\tStatute\nS. 232 deals with the power of the. appellate court or the High Court when it discovers that there is material error in the charge\tStatute\nThen we come to the other sub-head of this chapter\tStatute\nS. 233 provides that for every distinct offence of which any person is accused there shall be a. separate charge\tStatute\nIt thus lays down the normal rule to be followed in every case\tStatute\nBut it also provides that this will be subject to the exceptions contained in SS\tStatute\n234, 235, 236 and 239\tStatute\nThe first three provisions relate to the framing of charges against a single accused person\tStatute\nS. 234\tStatute\n1) deals with the trial of a person for offences of the same kind not exceeding three committed within the space of 12 months from the first to the last of such offences and s. 231 (2) what is meant by the expression 'offences of' the same kind\tStatute\nThis provision lifts partially the ban on the trial of a person for more than one offence at the same trial\tStatute\nS. 235(1), however, goes a step further and permits the trial of a person for more offences than one if they are so connected together as to form the same transaction\tStatute\nThus under this provision if the connection between the various offences is established the limitations placed by s. 234(1) both as regards the number and the period during which the offences are alleged to have been committed will not apply\tStatute\nFull effect cannot possibly be given to this provision if we hold that it is subject to the limitation of s.234(1\tStatute\nSub-s\tStatute\n2) of S. 235 deals with a case where an offence falls within two definitions and sub-s.(3) deals with a case in which a number of acts are alleged against an accused person, different com- binations of which may constitute different offences\tStatute\nThen we come to s. 236 which provides that if a single act or series of acts is of such a nature that it is doubtful which of several offences the facts which can be proved will constitute, the accused may be charged with having committed all or any of such offences and further provides that any number of such charges may be tried together\tStatute\nIt also permits that charges could be framed against an accused person in the alternative if the court thinks fit\tStatute\nThus, this is a special provision available in case of doubt and is neither subject to the limitations prescribed by s. 233 nor those of the other preceding provisions\tRatio of the decision\nNow, if the respondent No. 1 were alone tried upon the second, third and the fourth charges the provisions of s. 235(1) could have been pressed in aid if the allegations were that the offences were so connected together as to form one and the same transaction and the validity of the trial would not have been open to any attack\tRatio of the decision\nSimilarly if the second respondent were alone tried on the second charge his trial would not have been open to any objection if the allegation were that the offences were so connected together as to form the same transaction\tRatio of the decision\nHere, however, we have a case where the prosecution alleges that there was additionally a conspiracy to which apart from the two respondents the approver and some other persons were parties and where in both the respondents were tried together\tRatio of the decision\nA conspiracy must be regarded as one transaction and, there- fore, a single individual charged with it could be tried with the aid of s. 235(1) for all the acts committed by him in furtherance or in pursuance of the conspiracy without the limitations imposed by s.234(1\tRatio of the decision\nFor, where all the acts are referable to the same conspiracy their connection with one another is obvious\tRatio of the decision\nThe only provision in the Code which permits the joint trial of more than one person is s. 239 and what we have to see is whether under that provision the two respondents could have been jointly tried for the offences with which they were charged\tRatio of the decision\nLet us, therefore, examine closely the provisions of s. 239\tRatio of the decision\nIt will be useful to set out the provisions of that section which run thus :\" \"This first thing to be noticed is that s. 239 does not read as if its various clauses can be applied only alternatively\tStatute\nOn the other hand at the end of cl\tStatute\nf) there is a conjunction 'and\tStatute\nIf the intention of the Legislature was that the provisions of these clauses should be available only alternatively it would have used the word \"or\" and not \"and\" which has the opposite effect\tStatute\nGrammatically, therefore, it would appear that the provisions of the various clauses are capable of being applied cumulatively\tStatute\nThe opening words of the section show that it is an enabling provision and, therefore, the Court has a discretion to avail itself cumulatively of two or more clauses\tStatute\nOf course a Court has the power to depart from the grammatical construction if it finds that strict adherence to the grammatical construction will defeat the object the Legislature had in view\tStatute\nThe concluding portion of s. 239 shows that the provisions contained in the former part of Chapter XIX shall, as far as may be, apply to the charges framed with the aid of s. 239\tStatute\nDoes this mean that the provisions of s. 233, 234, 235, and 236 must also be complied with\tStatute\nObviously, s. 233 does not override the provisions of s. 239\tStatute\nS. 234 cannot also be regarded as an overriding provision because reading it that way will lead to the clear result that whereas several accused persons can be charged at the same trial with any number of different offences committed by them in the course of the same transaction they cannot be tried also for -offences of the same kind exceeding three in number and committed beyond a space of 12 months from the first to the last\tStatute\nIt could not have been the intention of the Legislature to create such a situation\tStatute\nAgain, as already stated, s. 234(1) does not override the provisions of s. 235(1) which permits trial of a person for more offences than one committed during any period provided they are so connected together as to form one transaction\tStatute\nUnless we read s. 234(1) as not enacting a fetter on s. 235(1), it may not be possible to give full effect to the latter\tStatute\nNow, since s. 234(1) cannot be properly read a, , ; overriding s. 235(1) there is no valid reason for construing it as overriding the provisions of s. 239 either\tStatute\nThere are also other reasons which point to this conclusion which we will set out while considering the argument advanced by Mr. Bhimasankaram\tStatute\nBhimasankaram contended that s, 239 must be read at least subject to ss\tStatute\n234(1) and 235(1) on the ground\tStatute\nthat if there are certain restrictions with respect to the trial of a single accused there is no reason why those restrictions will disappear if an accused person is tried along with several other persons\tStatute\nThus he points out that where several persons are accused of more offences than one of the same kind committed by them jointly within a period of 12 months, the number of offences for which they could be tried cannot exceed three\tStatute\nIn this connection he relied upon the words \"within the meaning of s. 224\" occurring in cl\tStatute\nc) of s. 239\tStatute\nThese words, he contended, clearly show that cl\tStatute\nc) of s. 239 is subject to the provisions of s. 234\tStatute\nIn our opinion the words \"within the meaning of s. 234\" indicate that what was meant by the words offence of the same kind\" \"'persons accused of more offences than one of the same kind not exceeding three in number\"or may have used the words\" person accused of more than one offence of the same kind to the extent permissible under s. 234\tStatute\nTherefore, even if the expression \"'same transaction\" alone had been used in s. 235(1) it would have meant a transaction consisting either of a single act or of a series of connec- ted acts\tRatio of the decision\nThe expression \"same transaction\" occurring in cls\tRatio of the decision\na), (c) and (d) of s. 239 as well as that occurring in s. 235(1) ought to be given the same meaning according to the normal rule of construction of statutes\tRatio of the decision\nLooking at the matter in that way, it is pointless to inquire further whether the provisions of s. 239 are subject to those of s. 236(1\tRatio of the decision\nThe provisions of sub-s\tRatio of the decision\n2) and (3) of s. 235 are enabling provisions and quite plainly can have no overriding effect\tRatio of the decision\nBut it would be open to the court to resort to those provisions even in the case of a joint trial of several persons permissible under s\tRatio of the decision\n239.S. 236\tRatio of the decision\nis also an enabling provision to be availed of in case of doubt and it is meaningless to say that s. 239 is subject to s. 236\tRatio of the decision\nBearing in mind the fact that the provisions in the \"former part\" of Chapter XIX are applicable to charges made with the aid of s. 239 only \"so far as may be\" it would not be right to construe s. 239 as being subject to the provisions of ss\tRatio of the decision\n233 to 236\tRatio of the decision\nIt was contended by Mr. Chari that the expression \"former part\" would apply to the first sub- division of chapter XIX which deals with the form and content of the charges and the powers of the court with regard to the absence of charge and alteration of charge\tRatio of the decision\nWe cannot, however, give the expression such a restricted meaning\tRatio of the decision\nFor, even in the absence of those words, the earlier provisions could not have been ignored\tRatio of the decision\nFor, it is a rule of construction that all the provisions of a statute are to be read together and given effect to and that it is, therefore, the duty of the Court to construe a statute harmoniously\tRatio of the decision\nThus, while it is clear that the sections preceding s. 239 have no overriding effect on that section, , the courts are not to ignore them but apply such of them as can be applied without detracting from the provisions of S.239\tRatio of the decision\nIndeed, the very expression 'so far as may be' empha- sises the fact that while the earlier provisions have to be borne in mind by the Court while applying s. 239 it is not those provisions but the latter which is to have an overriding effect\tRatio of the decision\nApart from this, the question whether the provisions of ss\tRatio of the decision\n233 to 236 have or have no overriding effect on s. 239\tRatio of the decision\nis not strictly germane to the question considered by the High Court that is, clubbing together all the provisions of the various clauses of s. 239\tRatio of the decision\nWhether they can or cannot be read cumulatively must be determined by consideration of the language used in those clauses\tRatio of the decision\nWe have already indicated how those clauses may be grammatically read\tRatio of the decision\nOn a plain construction of the provisions of s. 239, therefore, it is open to the Court to avail itself cumulatively of the provisions of the different clauses of s. 239 for the purpose of framing charges and charges so framed by it will not be in violation of the law, the provisions of ss\tRatio of the decision\n233, 234 and 235 notwithstanding\tRatio of the decision\nThe decision of the Allahabad High Court in T. R. Mukherji's case (IL), is directly in point and is clearly to the effect that the different clauses of s. 239 are mutually exclusive in the sense that it is not possible to combine the provisions of two or more clauses in any one case and to try jointly several persons partly by applying the provisions of one clause and partly by applying those of another or other clauses\tRatio of the decision\nA large number of decisions of the different High Courts and one of the Privy Council have been considered in this case\tRatio of the decision\nNo doubt, as has been rightly pointed out in this case, separate trial is the normal rule and joint trial is an exception\tRatio of the decision\nBut while this principle is easy to appreciate and follow where one person alone is the accused and the interaction or intervention of the acts of more persons than one does not come in, it would, where the same act is committed by several persons, be not only inconvenient but injudicious to try all the several persons separately\tRatio of the decision\nThis would lead to unnecessary multiplicity of trials involving avoidable inconvenience to the witnesses and avoidable expenditure of public time and money\tRatio of the decision\nNo corresponding advantage can be gained by the accused persons by following the procedure of separate trials\tRatio of the decision\nWhere, however, several offences are alleged to have been committed by several accused persons it may be more reasonable to follow the normal rule of separate trials\tRatio of the decision\nBut here, again, if those offences are alleged not to be wholly unconnected but as forming part of the same transaction the only consideration that will justify separate trials would be the embarrassment or difficulty caused to the accused persons in defending themselves\tRatio of the decision\nWe entirely agree with the High Court that joint trial should be founded on some 'principle\tRatio of the decision\nBut we find it difficult to appreciate what seems to be the view of the High Court that because each `clause of s. 239 enunciates a separate principle those principles are, so to speak, mutually' exclusive and cannot be cumulatively resorted to for trying several persons jointly in respect of several offences even though they form part of the same transaction\tRatio of the decision\nThe High Court has propounded that the connection described in each of the various clauses is mutually exclusive, that no two of them can exist simulta- neously in any case and that one cannot, therefore, have in any case persons connected with one another in two or more ways\tRatio of the decision\nIn other words, as the High Court puts it, persons included in two or more of the groups cannot all be tried together and that since there is absolutely nothing to connect one group with any other, the persons of one group cannot be tried with those of any other\tRatio of the decision\nNo reason has been stated in support of this view\tStatute\nLet us consider whether there is anything intrinsically incompatible in combining two clauses of s. 239\tStatute\nTake cls\tStatute\na) and (b\tStatute\nCl\tRatio of the decision\na) says that persons accused of the same offence committed in the course of the same transaction may be charged and tried together\tStatute\nb) says that persons accused of an offence and persons accused of abetment, or, of an attempt to commit such offence may also be charged and tried together\tStatute\nNow, if persons A, B and C are tried for an offence of murder what intrinsic difficulty would there be in trying X, Y and Z of abetment of the same offence\tRatio of the decision\nThe transaction in which all of them have participated is the same and the abetment by X, Y and Z of the offence committed by A, B and C would itself establish the connection of their acts with those of X, Y and Z\tRatio of the decision\nNext, let us take cls\tRatio of the decision\na) and (c\tRatio of the decision\nc) provides that persons accused of more than one offence of the same kind within the meaning of s. 234 committed by them jointly within the period of twelve months could also be charged and tried together\tRatio of the decision\nLet us consider these clauses along with another illustration\tRatio of the decision\nTwo persons A and B enter a house at night and first together commit the murder of a man sleeping there and then also his wife\tRatio of the decision\nEach of them has committed two offences and each of them participated in the same offence\tRatio of the decision\nWhy can they not be tried jointly for both murders and why should there be two trials for the two murders\tRatio of the decision\nThe offences are of the same kind and must be deemed to have been committed in the course of the same transaction because of association and mutual connection\tRatio of the decision\nNow, supposing in the illustration given A killed the man and B killed his wife\tRatio of the decision\nUnder cl\tRatio of the decision\nc) they could be tried together because the offences are of the same kind\tRatio of the decision\nIt would be ridiculous to say that they cannot be tried together for jointly committing the murder of the man and the wife because cl\tRatio of the decision\na) and (c) cannot be combined\tRatio of the decision\nFor, without combining these two clauses their joint trial for the two offences in each of which both have participated would be impermissible\tRatio of the decision\nThen take s. (a) and (d\tRatio of the decision\nd) persons accused of different offences committed in the course of the same transaction can be tried together\tRatio of the decision\nLet us suppose that a group of persons are accused of having been members of an unlawful assembly the common object of which was to overawe by sheer force another group of persons and take forcible possession of a piece of land\tRatio of the decision\nSome of the members of the unlawful assembly carried axes with them while some others carried lathis and attacked the other group\tRatio of the decision\nDuring the course of the attack one person from the second group was killed, as a rest of blows with an axe inflicted by the aggressors A, B and C. Two persons of the second group sustained grievous hurt as a result of lathi blows and one person sustained simple hurt\tRatio of the decision\nLet us say that the grievous hurt was caused as a result of lathi blows given by X and Y, simple hurt was caused by lathi blows given by Z\tRatio of the decision\nHere, the offences committed were those under ss\tRatio of the decision\n147, 302, 325 and 323, I.P.C\tRatio of the decision\nThe offences being different and the persons commiting the offences being different, they could not be tried jointly only with the help of cl\tRatio of the decision\na) of s. 239\tRatio of the decision\nNor again, could they be tried jointly only with the help of cl\tRatio of the decision\nd\tRatio of the decision\nYet the transaction in which the offences were committed is the same and there is a close association amongst the persons who have committed the different offences\tRatio of the decision\nWhat intrinsic difficulty is there in trying them all together simultaneously availing of cls\tRatio of the decision\na) and (d) of s. 239\tRatio of the decision\nThese are enabling provisions which circumstance implies that the court may avail itself of one or more of these provisions unless doing so would amount to an infringement of any of the provisions of the Code\tRatio of the decision\nAll these persons can be jointly tried for offences under s. 147 by recourse to cl\tRatio of the decision\na\tRatio of the decision\nSo also A, B and C could be jointly tried together for an offences under s. 302\tRatio of the decision\nX and Y can be charged not only with offences under ss\tRatio of the decision\n147 and 325, I. P.C. but also under s\tRatio of the decision\n302 read with s. 149\tRatio of the decision\nSimilarly Z can be charged with offence's under ss\tRatio of the decision\n147, 323 and offences under s. 302\tRatio of the decision\nread with s. 149 and s. 325\tRatio of the decision\nread with s. 149\tRatio of the decision\nThe same offence committed by all of them is that under s. 147 and all of them can be tried jointly in respect of that offence under cl\tRatio of the decision\nSimilarly, if we take cl\tRatio of the decision\nd) by itself all of them can be tried jointly for the different offences committed by each of them in the course of the same transaction and if cl\tRatio of the decision\na) is unavailable they could not be tried for the offence under s. 147 at the same trial\tRatio of the decision\nThis means that the trial for an offence under s. 147 will have to be separated from the trial for the different offences committed by them\tRatio of the decision\nIt is difficult to appreciate what purpose would be served by separating the trial for the same offence from the trial for different offences\tRatio of the decision\nTo repeat, the object of the legislature in enacting s. 239, Cr\tRatio of the decision\nP.C. clearly was to prevent multiplicity of trials and not only would that object be defeated but an extraordinary result will ensue if the various clauses of s. 239 are read disjunctively\tRatio of the decision\nThe reasons given by the Allahabad High Court, therefore, do not merit acceptance\tRatio of the decision\nThe decision in Singarachariar's Case 1934 Indlaw MAD 352\tRatio of the decision\nC.), has really no bearing upon the point before us\tRatio of the decision\nWhat was held there was that ss\tRatio of the decision\n235 (1) and s. 236 are mutually exclusive and if a case is covered by one of them it cannot be covered by the other\tRatio of the decision\nIn that case the question was whether a person who was first tried for an offence under s. 380, I.P.C. for stealing a blank second class railway ticket from the booking office, tried, for it and acquitted, could not be tried subsequently for the offence of forgery by making entries in that ticket and using it\tRatio of the decision\nThe acquittal in the previous case was urged as a bar under s. 403(1) of the Code to the trial for an offence under s. 467, I.P.C\tRatio of the decision\nThe contention apparently was that this was a case which fell under s. 236, Cr\tRatio of the decision\nP.C. and that if he had been tried alternatively for both the offences at the same trial the Court could have dealt with him under s. 237, Cr\tRatio of the decision\nThe High Court, however, held that to be a kind of case which fell under s. 235(1) of the Code and that since that was so, the provisions of s. 236 were excluded\tRatio of the decision\nIt is difficult to appreciate how this case assists the conclusion arrived at by the High Court\tRatio of the decision\nIn D.K. Chandra's Case 1951 Indlaw MUM 117, F. B) it was held that the provisions of ss\tRatio of the decision\n234, 235 and 236\tRatio of the decision\nbeing exceptions to s. 233 must be strictly construed and that if joinder of charges did not fall under any of them it would be illegal and contrary to law\tRatio of the decision\nThe precise point which we have to consider here did not fall for consideration in that case i.e., whether the provisions of the various clauses of s. 239 could be used together or not\tRatio of the decision\nThis decision is, therefore, of little assistance\tRatio of the decision\nOn the other band there is the decision of this Court in The State of Andhra Pradesh v. Kandinmlla Subbaiah , which is to the effect that where several persons had committed offences in the course of the same transactions, they could jointly be tried in respect of all those offences under s. 239 of the Code of Criminal Procedure and the limitation placed by s. 234 of the Code could not come into operation\tRatio of the decision\nThere, nine persons were jointly tried for 'an offence under s. 5 (1) (c) and (d) of the Prevention of Corruption Act, 1947, and s. 109, I. P. C. read with s' 420, s. 466 and s. 467, I. P. C. and all except one for offences under ss\tRatio of the decision\n420, 467/471, I.P.C\tRatio of the decision\nSome of them were also charged with separate offences under some of these provisions\tRatio of the decision\nTwo of the accused persons preferred a revision application before the High Court of Andhra Pradesh in which they challenged the charges framed against them\tRatio of the decision\nThe High Court allowed the revision application\tRatio of the decision\nBut on appeal by the State of Andhra Pradesh to this Court, this Court held that there was no misjoinder of charges, that the introduction of a large number of charges, spread over a long period was a question of propriety and that it should be left to the judge or the Magistrate trying the case to adopt the course which he thought to be appropriate in the facts and circumstances of the case\tRatio of the decision\nIn so far as some of the charges were concerned this Court pointed out that the Special judge who was to try the case should consider splitting them up so that the accused persons would not be prejudiced in answering the charges and defending themselves\tRatio of the decision\nIt is true that the question of reading the various clauses cumulatively did not specifically arise for decision in that case but the High Court had held that the first charge was an omnibus charge containing as many as 203 offences and that it was in direct violation of ss\tRatio of the decision\n234, 235 and 239 of the Code of Criminal Procedure\tRatio of the decision\nDealing with this matter this Court held at p. 200 : \"No doubt, sub-s\tRuling by Lower Court\n1) of s. 234 provides that not more than three offences of the same kind committed by an accused person within the space of 12 months can be tried at the same trial\tRuling by Lower Court\nBut then s. 235 (1) provides that if in any one series of acts so connected together as to form the same transaction more offences than one are committed by the same person, he may be charged with and tried at one trial for every such offence\tRuling by Lower Court\nTherefore, where the alleged offences have been committed in the course of the same transaction the limitation placed by s. 234 (1) cannot operate\tRuling by Lower Court\nNo doubt, the offence mentioned in charge No\tRuling by Lower Court\nI is alleged to have been committed not by just one person but by all the accused and the question is whether all these persons can be jointly tried in respect of all these offences\tRuling by Lower Court\nTo this kind of charges\tRuling by Lower Court\n239 would apply\tRuling by Lower Court\nThis section provides that the following persons may be charged and tried together, namely : (1) persons accused of the same offence committed in the course of the same transaction; (2) persons accused of abetment or an attempt to commit such an offence; (3) persons accused of different offences committed in the course of the same transaction\tRuling by Lower Court\nClearly, therefore, all the accused persons could be tried together in respect of all the offences now comprised in charge No. 1\tRuling by Lower Court\nThis Court has thus clearly read the provisions of the various clauses cumulatively and we see no reason to read them differently\tRuling by Lower Court\nThere remains the decision of this Court in K.V. Krishna Murthy Iyer v. The State of Madras (IN on which Mr. Bhimasankaram strongly relied\tRuling by Lower Court\nIn that case this Court upheld the order of the High Court of Madras in quashing the charges in the exercise of its inherent powers even before the conclusion of the trial\tRuling by Lower Court\nIt is true that there the charges were 67 in number and spread over a long period, of time\tRuling by Lower Court\nThat again was a matter which came before the High Court before conviction and not after the trial was over\tRuling by Lower Court\nWhen an objection is taken at an early stage, there is time enough to rectify an error\tRuling by Lower Court\nBut in the case before us no objection was taken to multiplicity or misjoinder of charges before the learned Additional Sessions judge and it was only in the High Court that the point was raised\tRuling by Lower Court\nIn such circumstances what the Court has to consider is whether prejudice has in fact been caused to the accused by reason of the multiplicity of charges or misjoinder, if any, of the charges\tRuling by Lower Court\nThis is quite clear from the provisions of s. 537 of the Code as amended by Act 26 of 1955\tRuling by Lower Court\nIn Willie (William) Slaney v. The State of Madhya Pradesh , all the learned judges were in agreement on the point that this section and s. 535 cover every case in which there is departure from the rules set out in Ch\tRuling by Lower Court\nXIX ranging from error, omissions and irregularities in charges that are framed, down to charges that might have been framed and were not and include a total omission to frame a charge at all at any stage of the trial\tRuling by Lower Court\nThe whole question has again been examined by this Court recently in Birichh Bhuian v. The State of Bihar Subba Rao J., who delivered the judgment of the Court has stated the position thus \"Even if we were to assume that there has been a misjoinder of charges in violation of the provisions of ss\tRuling by Lower Court\n233 to 239 of the Code, the High Court was incompetent to set aside the conviction of the respondents without coming to the definite conclusion that misjoinder had occasioned failure of justice\tRuling by Lower Court\nThis decision completely meets the argument based upon Dawson's Case\tRuling by Lower Court\nMerely because the accused persons are charged with a large number of offences and convicted at the trial the conviction cannot be set aside by the appellate court unless it in fact came to the conclusion that the accused persons were embarrassed in their defence with the result that there was a failure of injustice\tRuling by Lower Court\nFor all these reasons we cannot accept the argument of learned counsel on the ground of misjoinder of charges and multiplicity of charges\tRuling by Lower Court\nBhimasankaram, supporting the view taken by the High Court then contends that it is not permissible to frame a charge of conspiracy when the matter has proceeded beyond the stage of conspiracy and that in pursuance of it offences have actually been committed\tRuling by Lower Court\nA similar view was expressed by the same High Court in the case which was reversed by this Court in The State of Andhra Pradesh V. Kandinalla Subbaiah ( 1962 (2) SCR 194, ), and it was held that conspiracy to commit an offence being itself an offence a person can be separately charged with respect to such a conspiracy\tRuling by Lower Court\nThen this Court has observed\tRuling by Lower Court\nThis decision is sufficient to dispose of the point under consideration\tRatio of the decision\nIn Swamirathnam's case (1), which is a decision of this Court certain persons were tried for the offence of the conspiracy to cheat the members of the public and for specific offences of cheating in pursuance of that conspiracy\tPrecedent\nIt was urged before this Court that there was misjoinder of charges and persons\tPrecedent\nNegativing the contention\tPrecedent\nthis Court held that the charge as framed disclosed a single conspiracy although spread over several years, that there was one object of the conspiracy and that was to cheat the members of the public, that the fact that in the course of years other joined the conspiracy or that several incidents of cheating took place in pursuance of the conspiracy did not have the effect of splitting the conspiracy into several conspiracies\tPrecedent\nthat the several instances of cheating being alleged to be in pursuance of that conspiracy were parts of the same transaction and, therefore, the joint trial of the accused persons for the different offences was not vitiated\tPrecedent\nNo doubt, there is no discussion there as to the question whether the various clauses of s. 239 could be combined or as to the impact of the provisions of S. 233 to 236 on those of s. 239\tRatio of the decision\nThe actual decision of the case is, however, directly opposed to the contention now put forward before us\tRatio of the decision\nThis decision has been followed in Natwarlal Sakarlal\tRatio of the decision\nMody v. The State of Bombay\tRatio of the decision\nCrl. A\tRatio of the decision\nNo. III of 1959 decided on January 19, 1961\tRatio of the decision\nIn that case the impact of s. 120-B, I.P.C. on ss\tRatio of the decision\n233 and 239 of the Code of Criminal Procedure was considered by this Court and this Court observed\tRatio of the decision\nHere again, the question of clubbing together of the various provisions of cls\tArgument\na) to (d) of s. 239 was not raised expressly in the argument before the Court\tArgument\nBut the ultimate decision of the case would negative such argument\tArgument\nMr. Bhimasankaram then relying upon the decision in R. v. Dawson ( [1960] 2 W.L.R. 435, contended that in any event it was not desirable to try the respondents at the same trial for as many as 83 offences and pointed out that these observations had received the approval of this Court in The State of Andhra Pradesh v. Kandimalla Subbaiah ([1962] 2 B. C.R. 194\tArgument\nIn the first place there the trial had not actually begun\tArgument\nAgain, what was said by this Court was that it is undesirable to complicate a trial by introducing a large number of charges spread over a long period but even so this was a question of propriety which should be left to the discretion of the judge or Magistrate trying the case\tArgument\nObjection was taken very seriously by Mr. Bhimasankaram to the charge of conspiracy framed in this case\tArgument\nThat charge reads thus :\" \"Adverting to the portion which we have bracketed, his first objection was that the charge comprises within it not merely the conspiracy but also what was in fact done in pursuance of the conspiracy\tArgument\nHis next objection was that it brought within its purview all the various offences which were alleged to have been committed by the respondents\tArgument\nThe third objection was that no charge of conspiracy could have been framed after the conspiracy had borne its fruits\tArgument\nThe last objection was that the charge of conspiracy was added to the charge sheet very late\tArgument\nWe shall first deal with the third point\tArgument\nThe offence of conspiracy is an entirely independent offence and though other offences are committed in pursuance of the conspiracy the liability of the conspirators for the conspiracy itself cannot disappear\tArgument\nIn the Indian Penal Code, as originally enacted, conspiracy was not an offence\tArgument\nS. 120 -B which makes criminal conspiracy punishable was added by the Indian Criminal Law Amendment Act, 1913 (8 of 1913) along with s. 120-A. Section 120-A defines conspiracy and s. 120- B provides for the punishment for the offence of conspiracy\tArgument\nCriminal conspiracy as defined in s. 120-A and consists of an agreement to do an illegal act or an agreement to do an act which is not illegal by illegal means\tRatio of the decision\nS. 120 B provides that whoever is a party to a criminal conspiracy to commit an offence punishable with death, imprisonment for life or rigorous imprisonment for a term of two years or upwards shall be punishable in the same manner as if he has abetted such offence unless there was an express provision in the Code for the punishment of such conspiracy\tRatio of the decision\nCriminal conspiracy was, however, not an unknown thing before the amendment of the Indian Penal Code in 1913\tRatio of the decision\nBut what the amendment did was to make that conspiracy itself punishable\tRatio of the decision\nThe idea was to prevent the commission of crimes by, so to , speak, nipping them in the bud\tRatio of the decision\nBut it does not follow that where crimes have been committed the liability to punishment already incurred under s. 120-B by having entered into a criminal conspiracy is thereby wiped away\tRatio of the decision\nNo doubt, as already stated, where offences for committing which a conspiracy was entered into have actually been committed it may not, in the particular circumstances of a case, be desirable to charge the offender both with the conspiracy and the offences committed in pursuance of that conspiracy\tRatio of the decision\nBut that would be a matter ultimately within the discretion of the court before which the trial takes place\tRatio of the decision\nIn so far as the fourth point is concerned, that would have a bearing not on the form of the charge but on the credibility of the evidence bearing on the point of conspiracy\tRatio of the decision\nAs we are remanding the appeal to the High Court for a fresh decision after full consideration of the evidence adduced in the case it would be open to it to consider this matter particularly while judging the credibility of the-evidence of the approver\tRatio of the decision\nIn so far as the portion included in the bracket is concerned we agree with the learned counsel that it should not have found place there\tRatio of the decision\nThe ideas, however, of the committing magistrate in stating all that is said there appears to have been merely to describe the conspiracy and do nothing more\tRatio of the decision\nWe do not think that either that or the other objection raised, that is, that the charge embraces within it all the offences said to have been committed by the respondents can properly\tRatio of the decision\nbe said to vitiate the charge\tRatio of the decision\nThe object in saying what has been set out in the first charge was only to give notice to the respondents as to the ambit of the conspiracy to which they will have to answer and nothing more\tRatio of the decision\nEven assuming for a moment that this charge is cumbersome in the absence of any objection by the respondents at the proper time and in the absence of any material from which we could infer prejudice, they are precluded by the provisions of s. 225 from complaining about it at any rate after their conviction by the trial court\tRatio of the decision\nComing to the next point of Mr\tRatio of the decision\nBhimsankaram regarding the abuse of powers under s. 342 his first contention was that long and involved questions were put to the respondents\tRatio of the decision\nHis second contention was that reference was made to a number of documents in some of these questions and those documents were not made available to the respondents for answering those questions\tArgument\nThe third contention was that the questions were involved, confusing and bordered on cross-examination\tArgument\nFinally he said that the court did not perform its duty under s. 342 (4) of the Code as amended as it failed to bring to the notice of the respondents that they may, if they chose, give evidence in their defence\tArgument\nIn support of his first contention he referred to questions Nos\tArgument\n4, 8, 9, 10 and 20 put to the respondent No\tArgument\nI and question No. 12 put to the respondent No. 2 and tried to show that those questions rolled up a large number of separate questions and that it could not have been possible for the respondents to give any rational answers to those questions\tArgument\nWe have read the questions and so also the answers\tArgument\nWhile we are disposed to agree with learned counsel that the questions embrace a number of matters and that it would have been better if those matters had been made the subjects of separate questions, the answers given by the respondents clearly show that they understood the questions and wherever possible they have given complete answers to those questions\tArgument\nThat is to say, they have given their explantion regarding the circumstances appearing in the evidence set out in the questions and wherever that was not feasible they have said that they would do so in their written statements\tArgument\nIn fact written statements have been filed by each of them in which every point left over has been fully answered\tRatio of the decision\nWe are informed that the questions had been prepared before hand by the learned Additional Sessions judge, copies thereof were made available to each of the respondents and it was with reference to those copies that they gave their answers in the court\tRatio of the decision\nA pointed reference was made to question\tRatio of the decision\nNo. 20 put to respondent\tRatio of the decision\nNo\tRatio of the decision\nI which contains as many as 22 sub-heads and it is said that it was an extremely unfair and embarrassing question\tRatio of the decision\nWhat the learned Additional Sessions judge has done is to err on the side of over-cautiousness by putting every circumstance appearing in the evidence to the respondents for eliciting their explanations\tRatio of the decision\nHis object was to obviate the possibility of a complaint before the appellate court that they were denied the opportunity of explaining the circumstances appearing in evidence against them because of defective questions\tRatio of the decision\nNor again, do we think that there is any substance in the complaint made that the respondents had no opportunity of referring to the documents to which reference has been made in certain questions\tRatio of the decision\nNo objection was taken on their behalf before the learned Additional Sessions judge and from the manner in which they have answered the questions there is no doubt that they must have had opportunity to look at the relevant documents and answer the questions\tRatio of the decision\nWe are also satisfied that there is no substance in the complaint that the questioning bordered on cross-examination\tRatio of the decision\nUndoubtedly the learned Additional Sessions judge has questioned the respondents very fully and elaborately but to say that this bordered on cross- examination is wholly unjustifiable\tRatio of the decision\nThe object of the learned Additional Sessions Judge quite clearly was, as already stated, to leave no loophole for a complaint to be made before the appellate court of incomplete or insufficient examination under s. 342.Finally we are clear that it was not the duty of the court to draw the pointed attention of the respondents to the provisions of sub-s\tRatio of the decision\n4) of s. 342 and tell them that they may, if they chose, enter the witness box\tRatio of the decision\nIt is true that by introducing this provision the disability placed on an accused person in respect of giving evidence on oath in his own defence has been removed and to that extent such person is placed on par with an accused person under the English law\tRatio of the decision\nThe new provision, however, does no more than lift the ban and does not impose a duty on the court to draw the attention of an accused person to its contents\tRatio of the decision\nApart from that, the respondents were represented by counsel at the trial who knew very well what the law was\tRatio of the decision\nNo complaint was made by the respondents even in appeal that they were ignorant of their right, that had they known about it they would have given evidence on oath in their defence and that because of this they have been prejudiced\tRatio of the decision\nIn the circumstances this point must also be rejected as being without substance\tRatio of the decision\nThe irrelevant evidence to which Mr. Bhimasankaram referred was certain account books\tRatio of the decision\nThe entries in the. account books of VESCO show that certain sums of money were paid to various parties, Crompton Engineering Co., Lumin Electric Co., D. Brothers, Radio and Electrical, Madras, Vizagapatam Municipality, P. V. Ramanayya Bros., and Andhra Power System\tRatio of the decision\nThey also show payment case was that the payments which were entered in the account of VESCO do not find a place in the account books of the corresponding firms or authorities because they were never made by VESCO\tRatio of the decision\nThe High Court has pointed out that the main evidence on which the prosecution rests its case that the amount represented by the entries against these various firms were in\tRatio of the decision\nfact misappropriated by the, respondents in the circumstance that there are no corresponding entries in the account books of those firms\tRatio of the decision\nThe argument before the High Court was and before us is that, the absence of an entry cannot of electricity duty to Government\tRatio of the decision\nThe prosecution be established by reference to s. 34 of the Indian Evidence Act which reads thus\tRatio of the decision\nWhat it does is to make entries in books of account regularly kept in the course of business relevant in all proceedings in a court of law\tRatio of the decision\nThese entries are, however, not by themselves sufficient to charge any person with liability\tRatio of the decision\nTherefore, when A sues B for a sum of money it is open to him to put his account books' in evidence provided they are regularly kept in the course of business and show by reference to them that the amount claimed by him is debited against B\tRatio of the decision\nThe entry though made by A in his own account books, and though it is in his own favour is a piece of evidence which the court may take into consideration for the purpose of determining whether the amount referred to therein was in fact paid by A to B\tRatio of the decision\nThe entry by itself is of no help to A in his claim against B but it can be considered by the court along with the evidence of A for drawing the conclusion that the amount was paid by A to B\tRatio of the decision\nTo this limited extent entries -in the account books are relevant and can be proved\tRatio of the decision\nS. 34 does not go beyond that\tRatio of the decision\nIt says nothing about non-existence of entries in account books\tRatio of the decision\nWe, therefore, agree with the High Court that the account books of the various concerns to whom payments are said to have been made by the respondents are not by themselves evidence of the fact that no payments were received by them\tRatio of the decision\nThe decision in Queen Empress v. Grees Chunder Banerjee ((1884) I. L. R. 10\tRatio of the decision\nCal 1024.), upon which reliance is placed by the High Court in support of its view is also to that effect\tRatio of the decision\nSimilarly in Ram prashad Singh v. Lakhpati Koer ((1902) I. L. R. 30\tRatio of the decision\nCal 231, 247\tRatio of the decision\nLord Robertson during the course of the hearing has observed that no inference can be drawn from the absence of any entry relating to any particular matter which observation supports the view taken in Queen Empress v. Girish Chander Banerjee ( (1884) I.L.R. 10 C.L 1024\tRatio of the decision\nThat , however, is not the Only provision to be Considered\tRatio of the decision\nThere is s. II of the Evidence Act which provides that facts not otherwise relevant are relevant if they are inconsistent with any fact in issue or relevant fact\tRatio of the decision\nSome of the facts in issue in this case are whether payments of certain sums of money were made to Crompton Engineering Co., and other firms or authorities\tRatio of the decision\nThese are relevant facts\tRatio of the decision\nAbsence of entries in their account books would be inconsistent with the receipt of the accounts and would thus be a relevant fact which can be proved under s. 11\tRatio of the decision\nThe fact that no payments were received by those firms has been deposed to by persons connected with those firms and whose duty it was to receive and acknowledge amounts received by the firms or who were in charge of the accounts of these firms\tRatio of the decision\nFor the purpose of showing that no amounts were received by the firms, their account books would thus be as relevant as the VESCO account books for the purpose of showing the contrary\tRatio of the decision\nSimilarly there is s. 5 of the Evidence Act which reads thus:\" \"It is the case of the prosecution that the alleged payments were never made by VESCO to the various firms\tStatute\nIt is also their case that these firms maintain their accounts in the regular course of business and it is their practice to enter in those accounts all payments received by them\tStatute\nBoth the sets of facts are relevant, that is, non-receipt of the amounts by the firms and non-existence of entries in their account books pertaining to those amounts\tStatute\nIt is permissible, therefore, for the prosecution to lead evidence to , Drove both these facts\tStatute\nThe best evidence to prove the latter set of facts consists of the account books of the firms themselves\tStatute\nIt is under these provisions that the account books of the firms must be held to be relevant\tStatute\nWhat value to attach to them is another matter and would be for the Court of fact to consider\tStatute\nIt may further - be mentioned that the account books of VESCO show certain payments made to Billimoria & Co. of Kharagpur\tStatute\nPapers seized by the police include receipts purporting to have been signed by one J. J. Billimoria on behalf of the firm\tStatute\nThe prosecution case is that these receipts are forged documents and the entries in the account books of VESCO are false\tStatute\nOne of the partners of the firm was examined by the prosecution as a witness in the case and he produced the account books of the firm\tStatute\nThose account books are in Gujrati and he stated in his evidence that the accounts were regularly kept and that there were no entries in them corresponding to the entries in the VESCO accounts\tStatute\nThe High Court held that since the account books were not translated they are not admissible in evidence\tStatute\nThe High Court was clearly wrong in so holding\tStatute\nIn coming to this conclusion it has relied upon the provisions of s. 356 (2A) of the Code of Criminal Procedure\tStatute\nThat section reads thus:\" \"This provision relates only to the oral evidence adduced in a case and not to documentary evidence\tStatute\nMr. Bhimasankaram, therefore, very rightly did not support the view of the High Court\tStatute\nIn the circumstances we wish to say nothing further on the point\tStatute\nWe may, however, point out that Billimoria himself gave his evidence in English\tStatute\nAnother point urged by Mr. Bhimasankaram was that as many as 2, 000 documents were \"dumped\" by the prosecution in this case out of which 1600 documents were not sought to be proved by it\tArgument\nFurther, 64 documents were missing from the records when they came to the High Court and that this has caused serious prejudice to the respondent\tArgument\nNo objection, however, was taken in the courts below on this score and in the absence of any prejudice to the respondents\tRatio of the decision\nwe do not think that we should take notice of the complaint made by Mr. Bhimasankaram\tRatio of the decision\nThe third point stressed by him was that the approver was allowed to refresh his memory, while deposing in the case, by referring extensively to the account books and various documents produced in the case\tRatio of the decision\nThis, according to him, was an absue of the provisions of s. 159 of the Evidence Act\tRatio of the decision\nNow, s. 159 expressly enables a witness while under examination to refresh his memory by referring to any writing made by himself at the time of the transaction concerning which he is being questioned or soon afterwards, or to a writing made -similarly by another person and read by the witness immediately or soon after the writing was made\tRatio of the decision\nS. 160 provides that a witness may also testify to the facts mentioned in any such document as is mentioned in s. 159\tRatio of the decision\nThe complaint of Mr. Bhimasankaram is that the approver should have been questioned about the various facts which were sought to be established through his evidence and it was only if and when he was in a difficulty that he should have been allowed to refer to the account books\tRatio of the decision\nInstead of doing that what he was permitted to do was just to prove the various documents or read those documents and then depose with reference to them\tRatio of the decision\nIn our opinion, where a witness has to depose to a large number of transactions , and those transactions referred to are or mentioned either in the account books or in other documents there is nothing wrong in allowing the witness to refer to the account books and the documents while answering the questions put to him in his examination\tRatio of the decision\nHe cannot be expected to remember every transaction in all its details and s. 160 specifically permits a witness to testify the facts mentioned in the documents referred to in s. 159 although he has no recollection of the facts themselves if he is sure that the facts were correctly recorded in the document\tRatio of the decision\nThat is precisely what happened in this case and we do not think that the Additional Sessions judge adopted a procedure which was either a violation of law or was an abuse of the power of the Court\tRatio of the decision\nThe next point is a formidable one\tRatio of the decision\nAccording to Mr. Bhimasankaram, the pardon tendered to the approver was illegal and if the pardon is illegal his evidence is wholly inadmissible\tRatio of the decision\nFurther, according to him, the evidence of the approver was found by the Additional Sessions judge to be unreliable and therefore, the first condition referred to in Sarwan Singh v. The State of Punjab , was not satisfied\tRatio of the decision\nFor all these reasons the evidence of the approver must be left out of account\tRatio of the decision\nIf it is left out of account, he contends, there is nothing left in the prose- cution case, because, as pointed out by the Additional Sessions judge himself the evidence of the approver is the pivot of the prosecution case\tRatio of the decision\nThe pardon is stated to be illegal for two reasons\tRatio of the decision\nThe first reason is that none of the offences alleged to have been committed falls within s. 337 of the Code of Criminal Procedure and the second reason is that the pardon was granted by an authority not empowered to grant it\tRatio of the decision\nS. 337 (1) as it stood before its amendment by Act 26 of 1955 read thus\tRatio of the decision\nHis contention is that where none of the offences is exclusively triable by the High Court or the Court of Sessions pardon could be granted only if the offences are punishable with imprisonment which could extend to ten years but not if a higher punishment were provided for them\tArgument\nHere, one of the offences alleged against the respondents is criminal breach of trust punishable under s. 409, I.P.C\tArgument\nIt is not exclusively triable by a Court of Sessions and the punishment as set out in the 7th column of Schedule II, Cr\tArgument\nP. C. was transportation for life or imprisonment of either description for ten years and fine\tArgument\nHe contends that since the offence is punishable with transportation for life, s. 337 (1) could not be availed of for granting pardon to the approver\tArgument\nIt seems to us that it would not be correct to read s. 337 (1) in the way sought by learned counsel\tArgument\nThe very object of this provision is to allow pardon to be tendered in cases where a grave offence is alleged to have been committed by several persons so that with the aid of the evidence of the person pardoned the offence could be brought home to the rest\tArgument\nThe gravity is of course to be determined with reference to the sentence awardable with respect to that offence\tArgument\nOn the strength of these considerations Mr. Chari for the State contends that if the words \"any offence punishable with imprisonment which may extend to 10 years\" were interpreted to mean offences which were punishable with imprinsonment of less than 10 years grave offences which are not exclusively triable by a court of Sessions will be completely out of s. 337 (1\tArgument\nHe suggests that this provision can also be reasonably interpreted to mean that where the offences are punishable with imprisonment exceeding 10 years pardon may be granted to the approver\tArgument\nNo doubt, if this interpretation is accepted the object of the section, that is, to embrace within it the graver offences, would be fulfilled, but we wish to express no opinion on it\tRatio of the decision\nFor, the pardon granted in -this case can be regarded as being within the ambit of s. 337 (1) for another reason\tRatio of the decision\nIt will be noticed that transportation for life was not the only punishment provided for an offence under s. 409 of the Indian Penal Code even before the amendment made to the Indian Penal Code by s. 117 of the Act 26 of 1955, the other alternative being imprisonment up to 10 years\tRatio of the decision\nTherefore, since the offence under s. 409 was not merely punishable with transportation for life but alternately also punishable with imprisonment which could extend to 10 years, s. 337 (1) would apply\tRatio of the decision\nThis section does not expressly say that the only punishment provided for the offence should be imprisonment not exceeding 10 years\tRatio of the decision\nThe reason why two alternative maximum sentences are given in col\tRatio of the decision\n7, that is, transportation for life (now imprisonment for life) and imprisonment not exceeding 10 years appears to be that the offence is not exclusively triable by a court of session and could also be tried by a Magistrate, who, except when empowered under s. 30 would be incompetent to try offences punishable with transportation for life (now imprisonment for life) and the further reason that it should be open to the court of Session, instead of awarding the sentence of transportation for life to a convicted person to award him imprisonment in a jail in India itself for a period not execeeding 10 years\tRatio of the decision\nNow, of course, by the amendment made by s. 117 of Act 26 of 1955 for the words \"transportation for life\" the words \"imprisonment for life\" have been substituted, but the original structure of all the sections now amended continues\tRatio of the decision\nThat is why they read rather queer but even so they serve the purpose of allowing certain offences triable by a court of Session, to be triable also by Magistrates of the First Class\tRatio of the decision\nBe that as it may, there is no substance in the first ground\tRatio of the decision\nWhat we have said about pardon in respect of an offence under s. 409 would apply equally to that for one under s. 120-B because the punishment for it is the same as that for the offence under s. 409\tRatio of the decision\nThe offence under s. 467 read with s. 471 is punishable with imprisonment for life or imprisonment of either description for a period of 10 years but it is exclusively triable by a court of Session and, therefore, in so far as such offence is concerned the argument of Mr. Bhimasankaram would not even have been available\tRatio of the decision\nAs regards the offence under s. 477-A, it is one of those sections which are specifically enumerated in s. 337 (1) and the argument advanced before us-and which we have rejected would not even be available with regard to the pardon in respect of that offence\tRatio of the decision\nIt is true that the respondent No\tRatio of the decision\nI alone was convicted by the Additional Sessions judge of this offence and the offence under s. 467 read with s. 471 but the validity of a pardon is to be determined with reference to the offence alleged against the approver alone and not with reference to the offence or offences for which his associates were ultimately convicted\tRatio of the decision\nComing to the next ground of attack on the validity of pardon, the argument of Mr. Bhimasankaram is that whereas s. 337 (1) speaks of pardon being granted by a District Magistrate, or Presidency Magistrate, a Sub-Divisional Magistrate or any Magistrate of First Class, except in cases where an enquiry or trial was pending before another Magis- tratc, the pardon here was granted by the Additional District Magistrate in a case where an enquiry was pending before the District Magistrate and is, therefore, illegal and of no avail\tArgument\nHe contends that s. 337 (1) speaks of the District Magistrate which expression does not include an Additional District Magistrate\tArgument\nMr. Bhimasankaram's argument on the point may be summarised thus : Such a power cannot be conferred upon an Additional District Magistrate because s. 337 (1) does not contemplate grant of pardon by an Additional District Magistrate and that the Additional District Magistrate would have no status other than that of a Magistrate, First Class\tRatio of the decision\nNo doubt, under entry (9-a) in Part III of Sch\tRatio of the decision\nIII to the Code a Magistrate, First Class, has the power to grant pardon under s. 337 but it is limited by the proviso thereto to certain classes of cases\tRatio of the decision\nA case under enquiry or trial before another magistrate does not fall in any of these classes\tRatio of the decision\nTherefore, a pardon granted by him in such a case would be illegal\tRatio of the decision\nThe Magistrate before whom the enquiry or trial is proceeding or the District Magistrate would be the only authorities competent to grant a pardon in such a case\tRatio of the decision\nAlternatively, the State Government has not made any directions under sub-s\tRatio of the decision\n2) of s. 10 specifying the powers of the District Magistrate which would lie exercisable by the Additional District Magistrate concerned\tRatio of the decision\nIn order to appreciate and consider the argument it is desirable to bear in mind the changes in the magisterial set up in the former province of Madras which comprised within it the district of Visakhapatnam\tRatio of the decision\nBy Government Order No. 3106 dated September 9, 1949 the Government of the Province of Madras issued certain instructions to the Magistrates in pursuance of the separation of the judiciary from the executive\tRatio of the decision\nIt divided the magistrates into two groups, Judicial magistrates and executive magistrates\tRatio of the decision\nThe latter category comprises of the executive officers of the Revenue Department, on whom the responsibility for the maintenance of law and order was to continue to rest\tRatio of the decision\nPara 4 of the instructions provides\tRatio of the decision\nPara 5 provides that as officers of the Revenue Department, those magistrates would be under the control of the Government through the Board of Revenue\tRatio of the decision\nThe Additional District Magistrates (Independent) would also be under the control of the Government through the Board of Revenue\tRatio of the decision\nThe category of judicial Magistrates was constituted of the following: (1) District Magistrate; (2) Sub-divisional Magistrates; (3) Additional First Class Magistrates and (4) Second Class Magistrates (Sub- magistrates\tRatio of the decision\nThe District Magistrate was constituted as the principal magistrate of the District and as such was entrusted with the duty of general administration and superintendence and control over the other judicial magis- trates in the district\tRatio of the decision\nIn addition to his general supervisory functions and the special powers under the Code of hearing revision petitions, transfer petitions, appeals from Second Class Magistrates and the like, the District Magistrate was also to be assigned a specific area, the cases arising from which would be disposed of normally by himself\tRatio of the decision\nThis body of magistrates was made subordinate to the High Court\tRatio of the decision\nTill the separation between the judiciary and the executive was effected the Collector as the head of the Revenue Department was also the District Magistrate\tRatio of the decision\nConsequent on the separation\tRatio of the decision\nhe became only an Additional District Magistrate\tRatio of the decision\nPart IV of the Government order deals with the allocation of powers between the judicial and executive magistrates\tRatio of the decision\nPara 19(3) occurring in this part deals with allocation of powers under the provisions of the Code otherwise than these referred to in the earlier paragraphs\tRatio of the decision\nIt specifically provides that the power to tender pardon udder s. 337 shall be exercised by executive magistrates except in cases referred to in the proviso to sub-s\tRatio of the decision\n1) of that section, in which case a judicial magistrate may exercise that power\tRatio of the decision\nIn spite of the Government order all Magistrates who have, under Sch\tRatio of the decision\nIII to the Code of Criminal procedure the power to grant pardon will continue to have that power and, therefore, a pardon granted by a judicial Magistrate in contravention of the Government order will not be rendered invalid\tRatio of the decision\nHowever, that is not the point which is relevant while considering the argument of Mr. Bhimasankaram\tRatio of the decision\nHis point is that the proviso to s. 337(1) confers the power on \"the District Magistrate\" to grant pardon in a case pending before another Magistrate and not on \"a District Magistrate\" and, therefore, his power to grant pardon in such cases cannot be conferred under sub-s.(2) of s. 10 on an Additional District Magistrate\tRatio of the decision\nAccording to him, under that section only the powers of \"a District Magistrate\" meaning thereby only the powers under Entry 7 (a) in Part V of Sch\tRatio of the decision\nIII\tRatio of the decision\nas distinguished from the power under the proviso to s. 337 (1) can be conferred upon an Additional District Magistrate\tRatio of the decision\nSecondly, according to him, no direction has in fact been shown to have been made by the State Government conferring upon an Additional District Magistrate the power of the District Magistrate to grant pardon\tRatio of the decision\nIn our opinion, there is no subtance in the contention\tRatio of the decision\nThe power conferred by sub-s\tRatio of the decision\n1) of s. 337 on the different clauses of Magistrates is of the same character\tRatio of the decision\nThe power to grant pardon in a case pending before another Magistrate is no doubt conferred by the proviso only on the District Magistrate\tRatio of the decision\nBut Entry 7 (a) in Part V of Sch\tRatio of the decision\nIII when it refers to the power of a District Magistrate under s. 337 (1) does not exclude the power under the proviso\tRatio of the decision\nThere is, therefore, no warrant for drawing a distinction between the powers of \"the District Magistrate\" and the powers of \"'a District Magistrate\tRatio of the decision\nThe power of a District Magistrate to grant Pardon has been specifically conferred on Additional District Magistrates as would appear from s\tRatio of the decision\nno\tRatio of the decision\n37 of Sch\tRatio of the decision\nIII of the Government Order, which reads thus\tRatio of the decision\nMr. Chari for the State advanced a further argument before us in case his main argument that the pardon was valid failed and said that the approver, even if we ignore the pardon, was a competent witness\tArgument\nIn support of his contention he strongly relied upon the decision in Kandaswamy Gounder\tArgument\nIn re : the appellant (I.L.R. 1957 Mad 715 ), and the cases referred to therein, in particular the decision in Winson v. Queen ((1866) L.R. I Q.B\tArgument\nWhat has been held in all these cases is that where the trial of a person who was charged with having committed an offence or offences jointly with several persons is separated from the trial of those persons, he would be a competent witness against them though of course there will always be the question as to what weight should be attached to his evidence\tArgument\nMr. Chari then referred to s. 133 of the Evidence Act and pointed out that this section clearly makes an accomplice evidence admissible in a case and that an approver whose pardon is found to be invalid does not cease to be an accomplice and contends that he is, therefore, as competent a witness as he would have been if he had not been granted pardon at all and not been put on trial\tArgument\nLearned counsel further pointed out that the decisions show that however undesirable it may be to adduce the evidence of a person jointly accused of having committed an offence along with others, his evidence is competent and admissible except when it is given in a case in which he is being actually tried\tArgument\nThis legal position does not, according to him, offend the guarantee against testimonial compulsion and he points out that that is the reason why an accused person is not to be administered an oath when the court examines him under s. 342 (1) for enabling him to explain the circumstances appearing in evidence against him\tArgument\nIf pardon is tendered to an accused person and eventually it is found that the pardon is illegal such person is pushed back into the rank of an accused person and being no more than an accomplice would be a competent witness\tArgument\nThe question raised is an important one and requires a serious consideration\tRatio of the decision\nMr. Chari in support of his contention has cited a large number of cases, Indian as well as English, and certain passages from Halsbury's Laws of England\tRatio of the decision\nBut in the view we take about the legal validity of the pardon tendered, we do not wish to pronounce one way or the other on this very interesting question\tRatio of the decision\nNow, as regards the reliability of the approver\tRatio of the decision\nIt is no doubt true that an approver has always been regarded as an infamous witness, who, on his own showing has participated in a crime or crimes and later to save his own skin, turned against his former associates and agreed to give evidence against them in the hope that he will be pardoned for the offence committed by him\tRatio of the decision\nThe High Court seems to think that before reliance could be placed upon the evidence of the approver it must appear that he is a penitent witness\tRatio of the decision\nThat, in our opinion, is not the correct legal position\tRatio of the decision\nThe section itself shows that the motivating factor for an approver to turn, what in England is called \"King's evidence\" is the hope of pardon and not any noble sentiment like contrition at the evil in which he has participated\tRatio of the decision\nWhether the evidence of the approver should in any given case be accepted or not will have to be determined by applying the usual tests such as the probability of the truth of what he has deposed to the circumstances in which he has come to give evidence whether he has made a full and complete disclosure, whether his evidence is merely self-exculpatory and so on and so forth\tRatio of the decision\nThe court has, in addition, to ascertain whether his evidence has been corroborated sufficiently in material particulars\tRatio of the decision\nWhat is necessary to consider is whether applying all these tests we should act upon the evidence of the approver should be acted upon\tRatio of the decision\nWe however, find that certain documents upon which Mr. Chari wants to rely are not included in the paper book\tRatio of the decision\nIt would take considerable time if we were to adjourn this matter now and give an opportunity to the parties to include those documents on record\tRatio of the decision\nThe better course would be for us to set aside the acquittal of the respondents and send back the appeal to the High Court ?or being decided on merits\tRatio of the decision\nThe High Court will of course be bound by the finding which we have given on the questions of law agitated before us\tRatio of the decision\nWhat it must now do is to consider the entire evidence and decide for itself whether it is sufficient to bring home all or any of the offences to the respondents\tRatio of the decision\nWe may mention that the High Court's observation that the approver's evidence was treated as unreliable by the learned Additional Sessions judge is not correct\tRatio of the decision\nOf course, the view taken by the Additional Sessions judge is not binding on the High Court\tRatio of the decision\nBut it should remove from its mind the misconception that the Additional Sessions judge has not believed him\tRatio of the decision\nThere is another thing which we would like to make clear\tRatio of the decision\nThe decision in Sarwan Singh v. The State of Punjab ([1957] B. C. R. 953.), on which reliance has been placed by the High Court has been explained by this Court in the case of Maj\tRatio of the decision\nE. G. Barsay v. The State of Bombay\tRatio of the decision\nThis Court has pointed out in the latter decision that while it must be shown that the approver is a witness of truth, the evidence adduced in a case cannot be considered in compartments and that even for judging the credibility of, the approver the evidence led to corroborate him in material particulars would be relevant for consideration\tRatio of the decision\nThe High Court should bear this in mind for deciding whether the evidence of the approver should be acted upon or not\tRatio of the decision\nThen again it would not be sufficient for the High Court to deal with the evidence in a general way\tRatio of the decision\nIt would be necessary for it to consider for itself the evidence adduced by the prosecution on the specific charges and then to conclude whether those charges have been established or not\tRatio of the decision\nThe prosecution would be well, advised if, instead of placing the evidence on each and every one of those large number of charges against the respondents, it chooses to select a few charges under each head other than the head of conspiracy and concentrates on establishing those charges, this would save public time and also serve the purpose of the prosecution\tRatio of the decision\nWith these observations we set aside the acquittal of the respondents and remit the appeal to the High Court for decision on merits in the light of our observations\tRatio of the decision\nAppeal allowed\tRuling by Present Court\nCase remanded\tRuling by Present Court\n"}}